azure/repind-ri-ws/api/CreateOrUpdateIndividualWS/v7/Regression Tests/CreateUpdate Travel Companion/CreateOrUpdate Wrong Firstname.bru

meta {
  name: CreateOrUpdate Wrong Firstname
  type: http
  seq: 3
}

post {
  url: {{create-or-update-individual-v7-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/CreateUpdateIndividualService-v7/createIndividual"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.af-klm.com/services/passenger/data-v7/xsd">
     <soapenv:Body>
        <xsd:CreateUpdateIndividualRequestElement>
           <requestor>        
              <channel>B2C</channel>        
              <context>B2C_BOOKING_PROCESS</context>        
              <token>WSSiC2</token>        
              <applicationCode>ISI</applicationCode>        
              <site>VLB</site>        
              <signature>REPIND-3232</signature>    
           </requestor>        
           <individualRequest>        
              <individualInformations>            
                 <identifier>400508465441</identifier>        
              </individualInformations>    
           </individualRequest>   
           <marketingDataRequest>        
              <marketingInformation>            
                 <travelCompanion>                
                    <civility>MR</civility>                
                    <firstName>VALOU2</firstName>                
                    <lastName>POIROT</lastName>                
                    <dateOfBirth>1964-01-01T00:00:00Z</dateOfBirth>                
                    <email>POI@REP.COM</email>            
                 </travelCompanion>            
                 <personalInformation/>        
              </marketingInformation>    
           </marketingDataRequest>     
        </xsd:CreateUpdateIndividualRequestElement>
     </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000442
  PASSWORD: pswpsw123
  TRACKER: true
  USER_TRACKER: w21375138
  LOCATION: QVI
}

assert {
  res.status: eq 500
}
